number1 = float(input("10 "))
number2 = float(input("5 "))


comparison_result = number1 > number2  


print("გამარჯობა! მოდი ვისაუბროთ მუსიკაზე.")

# მომხმარებლისგან საყვარელი მუსიკალური ჟანრის გაგება
favorite_genre = input("რომელი მუსიკალური ჟანრი მოგწონთ ყველაზე მეტად? ")

# პასუხის მიხედვით გაგრძელება
if favorite_genre.lower() == "როკი":
    print("როკი ძალიან ენერგიული ჟანრია! ვინ არის თქვენი საყვარელი როკ მუსიკოსი ან ბენდი?")
    favorite_band = input("ჩემი საყვარელი როკ ბენდი არის: ")
    print(f"{favorite_band} ძალიან კარგია! გაქვთ საყვარელი სიმღერა მათგან?")
    favorite_song = input("ჩემი საყვარელი სიმღერა არის: ")
    print(f"მესმის, '{favorite_song}' მართლაც შესანიშნავი არჩევანია!")
elif favorite_genre.lower() == "პოპი":
    print("პოპი ძალიან პოპულარული და მრავალფეროვანი ჟანრია! ვინ არის თქვენი საყვარელი პოპ მუსიკოსი?")
    favorite_artist = input("ჩემი საყვარელი პოპ არტისტი არის: ")
    print(f"{favorite_artist} ძალიან ნიჭიერია! გაქვთ საყვარელი ალბომი მათგან?")
    favorite_album = input("ჩემი საყვარელი ალბომი არის: ")
    print(f"'{favorite_album}' მართლაც შესანიშნავია!")
else:
    print(f"{favorite_genre} საინტერესო არჩევანია! მოგწონთ ამ ჟანრის სხვა მუსიკოსები ან ბენდები?")
    other_favorites = input("ჩემი სხვა საყვარელი მუსიკოსები ან ბენდები ამ ჟანრიდან არიან: ")
    print(f"{other_favorites} მართლაც შესანიშნავია! მადლობა, რომ გაგიზიარეთ თქვენი გემოვნება.")

print("მიხარია, რომ ვისაუბრეთ მუსიკაზე! სასიამოვნო დღის გაგრძელებას გისურვებთ!")

#if elif else გამოყენებული მაქ რადგან გვიან დავწერე გამოტოვებული დავალებები გავლილი მაქ უკვე